Пансион83/src/Catalogs/Тарифы/Тарифы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тарифы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>DescriptionTranslations</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RoomRateType</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceTagType</name>
    <type>
      <types>EnumRef.PriceTagTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ServicePackage</name>
    <type>
      <types>CatalogRef.ПакетыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>DateValidFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Calendar</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>PeriodInHours</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DurationCalculationRuleType</name>
    <type>
      <types>EnumRef.DurationCalculationRuleTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceHour</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstDayEndsAtReferenceHourTime</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultCheckInTime</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsRackRate</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsOnlineRate</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRateServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundPriceDigits</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NoDiscounts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NoAgentCommission</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MaxAgentCommission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsComplimentary</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotPrintRate</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReservationConditionsShort</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReservationConditionsOnline</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReservationConditions</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethodCodesAllowedOnline</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MarketingCode</name>
    <type>
      <types>CatalogRef.КодМаркетинга</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceOfBusiness</name>
    <type>
      <types>CatalogRef.ИсточИнфоГостиница</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientType</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientTypeConfirmationText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HotelProductType</name>
    <type>
      <types>CatalogRef.ПутевкиКурсовки</types>
    </type>
  </attributes>
  <attributes>
    <name>UseNewFolioIfCheckOutDateChanged</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRatesApproved</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotRefillOccupationPercentsAfterInHouseRoomChange</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MLOSIsBlocking</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Allotment</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>FeeTerms</name>
    <type>
      <types>CatalogRef.ШтрафыУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>IdentificationCardType</name>
    <type>
      <types>CatalogRef.ТипКартИД</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>CreateDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ServicePackages</name>
    <attributes>
      <name>ServicePackage</name>
      <type>
        <types>CatalogRef.ПакетыУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/Catalogs/Тарифы/ObjectModule.bsl
//-----------------------------------------------------------------------------
// Get list of prices for given ГруппаНомеров rate and parameters
// - pDate is optional. If is not specified, then function gets current prices
// - pClientType is optional. If is not specified then it is being set to empty ref.
// - pRoomType is optional. If is specified, then prices for this given ГруппаНомеров type 
//   are returned.
// - pAccommodationType is optional. If is specified, then prices for this given 
//   accommodation type are returned.
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
Function pmGetRoomRateServicePackagesList(pServicePackagesList = Неопределено) Экспорт
	vPackagesList = New СписокЗначений();
	If ЗначениеЗаполнено(ServicePackage) Тогда
		vPackagesList.Add(ServicePackage);
	EndIf;
	For Each vServicePackagesRow In ServicePackages Do
		If ЗначениеЗаполнено(vServicePackagesRow.ServicePackage) Тогда
			If vPackagesList.FindByValue(vServicePackagesRow.ServicePackage) = Неопределено Тогда
				vPackagesList.Add(vServicePackagesRow.ServicePackage);
			EndIf;
		EndIf;
	EndDo;
	If pServicePackagesList <> Неопределено Тогда
		For Each vServicePackagesListItem In pServicePackagesList Do
			If ЗначениеЗаполнено(vServicePackagesListItem.Value) Тогда
				vPackagesList.Add(vServicePackagesListItem.Value);
			EndIf;
		EndDo;
	EndIf;
	Return vPackagesList;
EndFunction //pmGetRoomRateServicePackagesList

//-----------------------------------------------------------------------------
Function pmGetRoomRateDescription(pLang) Экспорт
	vDescr = "";
	If НЕ ЗначениеЗаполнено(pLang) Тогда
		vDescr = СокрЛП(Description);
	Else
		If IsBlankString(DescriptionTranslations) Тогда
			vDescr = СокрЛП(Description);
		Else
			vDescr = СокрЛП(DescriptionTranslations);
		EndIf;
	EndIf;
	Return vDescr;
EndFunction //pmGetRoomRateDescription

//-----------------------------------------------------------------------------
Процедура pmFillAttributesWithDefaultValues() Экспорт
	Author = ПараметрыСеанса.ТекПользователь;
	CreateDate = CurrentDate();
	Гостиница = ПараметрыСеанса.ТекущаяГостиница;
КонецПроцедуры //pmFillAttributesWithDefaultValues

//-----------------------------------------------------------------------------
// Returns MLOS and CTA for the given check-in date and ГруппаНомеров type
//-----------------------------------------------------------------------------
Function pmGetRoomRateRestrictions(pCheckInDate, pCheckOutDate, pRoomType, pWithoutOnline = False) Экспорт
	vRestrStruct = New Structure("MLOS, MaxLOS, MinDaysBeforeCheckIn, MaxDaysBeforeCheckIn, CTA, CTD", 0, 0, 0, 0, False, False);
	If НЕ ЗначениеЗаполнено(pCheckInDate) Or НЕ ЗначениеЗаполнено(pCheckOutDate) Тогда
		Return vRestrStruct;
	EndIf;
	// Get week days
	vDayOfWeek = WeekDay(pCheckInDate);
	vCheckOutDayOfWeek = WeekDay(pCheckOutDate);
	// Get accounting dates
	vAccountingDate = BegOfDay(pCheckInDate);
	vCheckOutAccountingDate = BegOfDay(pCheckOutDate);
	// Try to get calendar day type for the check-in date
	
	vQry = New Query();
	vQry.Text = "SELECT
	            |	RoomRateRestrictions.Гостиница,
	            |	RoomRateRestrictions.Тариф,
	            |	RoomRateRestrictions.ТипНомера,
	            |	RoomRateRestrictions.ТипДеньКалендарь,
	            |	RoomRateRestrictions.DayOfWeek,
	            |	RoomRateRestrictions.УчетнаяДата,
	            |	RoomRateRestrictions.MLOS,
	            |	RoomRateRestrictions.MaxLOS,
	            |	RoomRateRestrictions.CTA,
	            |	RoomRateRestrictions.CTD,
	            |	RoomRateRestrictions.MinDaysBeforeCheckIn,
	            |	RoomRateRestrictions.MaxDaysBeforeCheckIn,
	            |	RoomRateRestrictions.IsForOnlineOnly
	            |FROM
	            |	InformationRegister.RoomRateRestrictions AS RoomRateRestrictions
	            |WHERE
	            |	RoomRateRestrictions.Тариф = &qRoomRate
	            |	AND (RoomRateRestrictions.Гостиница = &qEmptyHotel
	            |			OR &qHotelIsFilled
	            |				AND RoomRateRestrictions.Гостиница = &qHotel)
	            |	AND (RoomRateRestrictions.ТипНомера = &qEmptyRoomType
	            |			OR &qRoomTypeIsFilled
	            |				AND RoomRateRestrictions.ТипНомера = &qRoomType)
	            |	AND (RoomRateRestrictions.ТипДеньКалендарь = &qEmptyCalendarDayType
	            |			OR &qCalendarDayTypeIsFilled
	            |				AND RoomRateRestrictions.ТипДеньКалендарь = &qCalendarDayType)
	            |	AND (RoomRateRestrictions.DayOfWeek = 0
	            |			OR RoomRateRestrictions.DayOfWeek = &qDayOfWeek
	            |				AND NOT RoomRateRestrictions.CTD
	            |				AND RoomRateRestrictions.DayOfWeek > 0
	            |			OR RoomRateRestrictions.DayOfWeek = &qCheckOutDayOfWeek
	            |				AND RoomRateRestrictions.CTD
	            |				AND RoomRateRestrictions.DayOfWeek > 0)
	            |	AND (RoomRateRestrictions.УчетнаяДата = &qEmptyDate
	            |			OR &qAccountingDateIsFilled
	            |				AND RoomRateRestrictions.УчетнаяДата = &qAccountingDate
	            |				AND NOT RoomRateRestrictions.CTD
	            |			OR RoomRateRestrictions.CTD)
	            |	AND (RoomRateRestrictions.УчетнаяДата = &qEmptyDate
	            |			OR &qCheckOutAccountingDateIsFilled
	            |				AND RoomRateRestrictions.УчетнаяДата = &qCheckOutAccountingDate
	            |				AND RoomRateRestrictions.CTD
	            |			OR NOT RoomRateRestrictions.CTD)
	            |	AND (NOT &qWithoutOnline
	            |			OR &qWithoutOnline
	            |				AND NOT RoomRateRestrictions.IsForOnlineOnly)";
	vQry.SetParameter("qRoomRate", Ref);
	vQry.SetParameter("qHotel", Гостиница);
	vQry.SetParameter("qHotelIsFilled", ЗначениеЗаполнено(Гостиница));
	vQry.SetParameter("qEmptyHotel", Справочники.Гостиницы.EmptyRef());
	vQry.SetParameter("qRoomType", pRoomType);
	vQry.SetParameter("qRoomTypeIsFilled", ЗначениеЗаполнено(pRoomType));
	vQry.SetParameter("qEmptyRoomType", Справочники.ТипыНомеров.EmptyRef());
	
	vQry.SetParameter("qEmptyCalendarDayType", Справочники.ТипДневногоКалендаря.EmptyRef());
	vQry.SetParameter("qDayOfWeek", vDayOfWeek);
	vQry.SetParameter("qCheckOutDayOfWeek", vCheckOutDayOfWeek);
	vQry.SetParameter("qAccountingDate", vAccountingDate);
	vQry.SetParameter("qAccountingDateIsFilled", ЗначениеЗаполнено(vAccountingDate));
	vQry.SetParameter("qCheckOutAccountingDate", vCheckOutAccountingDate);
	vQry.SetParameter("qCheckOutAccountingDateIsFilled", ЗначениеЗаполнено(vCheckOutAccountingDate));
	vQry.SetParameter("qEmptyDate", '00010101');
	vQry.SetParameter("qWithoutOnline", pWithoutOnline);
	vRestrictions = vQry.Execute().Unload();
	For Each vRestrictionsRow In vRestrictions Do
		If vRestrictionsRow.CTA Тогда
			vRestrStruct.CTA = True;
		EndIf;
		If vRestrictionsRow.CTD Тогда
			vRestrStruct.CTD = True;
		EndIf;
		If vRestrictionsRow.MLOS > vRestrStruct.MLOS Тогда
			vRestrStruct.MLOS = vRestrictionsRow.MLOS;
		EndIf;
		If vRestrictionsRow.MaxLOS <> 0 And (vRestrStruct.MaxLOS = 0 Or vRestrictionsRow.MaxLOS < vRestrStruct.MaxLOS) Тогда
			vRestrStruct.MaxLOS = vRestrictionsRow.MaxLOS;
		EndIf;
		If vRestrictionsRow.MinDaysBeforeCheckIn > vRestrStruct.MinDaysBeforeCheckIn Тогда
			vRestrStruct.MinDaysBeforeCheckIn = vRestrictionsRow.MinDaysBeforeCheckIn;
		EndIf;
		If vRestrictionsRow.MaxDaysBeforeCheckIn <> 0 And (vRestrStruct.MaxDaysBeforeCheckIn = 0 Or vRestrictionsRow.MaxDaysBeforeCheckIn < vRestrStruct.MaxDaysBeforeCheckIn) Тогда
			vRestrStruct.MaxDaysBeforeCheckIn = vRestrictionsRow.MaxDaysBeforeCheckIn;
		EndIf;
	EndDo;
	Return vRestrStruct;
EndFunction //pmGetRoomRateRestrictions

//-----------------------------------------------------------------------------
Процедура OnCopy(pCopiedObject)
	If НЕ IsFolder Тогда
		Author = Справочники.Сотрудники.EmptyRef();
		CreateDate = '00010101';
		IsOnlineRate = False;
	EndIf;
КонецПроцедуры //OnCopy
